Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: Unlike the plain `Contains` and `Each` this allows to check for arbitrary occurrences including testing for absence with `Contains(e).Times(0)`.
it_it: A differenza dei semplici `Contains` e `Each` questo consente di verificare la presenza di occorrenze arbitrarie, incluso il test per l'assenza con `Contains(e).Times(0)`.

source: Unprotected commas, i.e. commas which are not surrounded by parentheses, prevent MOCK_METHOD from parsing its arguments correctly:
it_it: Le virgole non-protette, ovvero le virgole non racchiuse tra parentesi, impediscono a MOCK_METHOD di analizzare correttamente i suoi argomenti:

source: Unprotected commas, i.e. commas which are not surrounded by parentheses, prevent `MOCK_METHOD` from parsing its arguments correctly:
it_it: Le virgole non-protette, ovvero le virgole non racchiuse tra parentesi, impediscono a `MOCK_METHOD` di analizzare correttamente i suoi argomenti:

source: Upon failure, EXPECT_ macros generate nonfatal failures and allow the current function to continue running, while ASSERT_ macros generate fatal failures and abort the current function.
it_it: In caso di errore, le macro EXPECT_ generano errori nonfatal e consentono alla funzione corrente di continuare l'esecuzione, mentre le macro ASSERT_ generano errori irreversibili e interrompono la funzione corrente.

source: Upon failure, `EXPECT_` macros generate nonfatal failures and allow the current function to continue running, while `ASSERT_` macros generate fatal failures and abort the current function.
it_it: In caso di errore, le macro `EXPECT_` generano errori nonfatal e consentono alla funzione corrente di continuare l'esecuzione, mentre le macro `ASSERT_` generano errori irreversibili e interrompono la funzione corrente.

source: Upon start, Google Test creates the file which will be automatically deleted after all work has been finished.
it_it: All'avvio, Google Test crea il file che verrà automaticamente eliminato al termine di tutto il lavoro.

source: Usage of NaggyMock<T> is analogous to usage of T.
it_it: L'utilizzo di NaggyMock<T> è analogo a quello di T.

source: Usage of NiceMock<T> is analogous to usage of T.
it_it: L'utilizzo di NiceMock<T> è analogo a quello di T.

source: Usage of StrictMock<T> is analogous to usage of T.
it_it: L'utilizzo di StrictMock<T> è analogo a quello di T.

source: Usage of `NaggyMock<T>` is analogous to usage of `T`.
it_it: L'utilizzo di `NaggyMock<T>` è analogo a quello di `T`.

source: Usage of `NiceMock<T>` is analogous to usage of `T`.
it_it: L'utilizzo di `NiceMock<T>` è analogo a quello di `T`.

source: Usage of `StrictMock<T>` is analogous to usage of `T`.
it_it: L'utilizzo di `StrictMock<T>` è analogo a quello di `T`.

source: Usage requires exceptions to be enabled in the build environment.
it_it: L'utilizzo richiede che le eccezioni siano abilitate nell'ambiente di compilazione.

source: Use EXPECT_STREQ to compare C strings (e.g. const char*) by value.
it_it: Usare EXPECT_STREQ per confrontare stringhe C (ad esempio const char*) per valore.

source: Use EXPECT_STRNE to compare C strings (e.g. const char*) by value.
it_it: Usare EXPECT_STRNE per confrontare stringhe C (ad esempio const char*) per valore.

source: Use Pair when comparing maps or other associative containers.
it_it: Si usa Pair quando si confrontano mappe o altri container associativi.

source: Use [`EXPECT_STREQ`](#EXPECT_STREQ) to compare C strings (e.g. `const char*`) by value.
it_it: Usare [`EXPECT_STREQ`](#EXPECT_STREQ) per confrontare stringhe C (ad esempio `const char*`) per valore.

source: Use [`EXPECT_STRNE`](#EXPECT_STRNE) to compare C strings (e.g. `const char*`) by value.
it_it: Usare [`EXPECT_STRNE`](#EXPECT_STRNE) per confrontare stringhe C (ad esempio `const char*`) per valore.

source: Use `Pair` when comparing maps or other associative containers.
it_it: Si usa `Pair` quando si confrontano mappe o altri container associativi.

source: Use a recent hash on the main branch.
it_it: Utilizzare un hash recente sul branch main.

source: Use a recent hash on the `main` branch.
it_it: Utilizzare un hash recente sul branch `main`.

source: Use case example:
it_it: Esempio di caso d'uso:

source: Use either ReturnRef() or ReturnPointee() for this purpose.
it_it: Si usa oReturnRef() oppure ReturnPointee() per questo.

source: Use either `ReturnRef()` or `ReturnPointee()` for this purpose.
it_it: Si usa o `ReturnRef()` oppure `ReturnPointee()` per questo.

source: Use the += operator to add Expectation objects to the set:
it_it: Usare l'operatore += per aggiungere oggetti Expectation all'insieme:

source: Use the << operator to store a failure message:
it_it: Utilizzare l'operatore << per memorizzare un messaggio di errore:

source: Use the TEST() macro to define and name a test function.
it_it: Si usa la macro TEST() per definire e dare un nome a una funzione di test.

source: Use the `+=` operator to add [`Expectation`](#Expectation) objects to the set:
it_it: Usare l'operatore `+=` per aggiungere oggetti [`Expectation`](#Expectation) all'insieme:

source: Use the `<<` operator to store a failure message:
it_it: Utilizzare l'operatore `<<` per memorizzare un messaggio di errore:

source: Use the `TEST()` macro to define and name a test function.
it_it: Si usa la macro `TEST()` per definire e dare un nome a una funzione di test.

source: Use this function in main() to run all tests.
it_it: Utilizzare questa funzione in main() per eseguire tutti i test.

source: Use this function in `main()` to run all tests.
it_it: Utilizzare questa funzione in `main()` per eseguire tutti i test.

source: Useful Mocks Created Using gMock
it_it: Mock Utili Creati Con gMock

source: Useful as syntactic sugar in .With(AllArgs(m)).
it_it: Utile come "zucchero" sintattico in .With(AllArgs(m)).

source: Useful as syntactic sugar in `.With(AllArgs(m))`.
it_it: Utile come "zucchero sintattico" in `.With(AllArgs(m))`.

source: Useful for specifying sequences of expectations; see the After clause of EXPECT_CALL.
it_it: Utile per specificare sequenze di expectation; vedere la clausola After di EXPECT_CALL.

source: Useful for specifying sequences of expectations; see the [`After`](#EXPECT_CALL.After) clause of `EXPECT_CALL`.
it_it: Utile per specificare sequenze di expectation; vedere la clausola [`After`](#EXPECT_CALL.After) clause of `EXPECT_CALL`.

source: Useful on Windows.
it_it: Utile su Windows.

source: User code is *prohibited* from using such identifiers.
it_it: Al codice utente è *vietato* utilizzare tali identificatori.

source: User code is prohibited from using such identifiers.
it_it: Al codice utente è vietato utilizzare tali identificatori.

source: Using pkg-config in CMake is fairly easy:
it_it: L'uso di pkg-config in CMake è abbastanza semplice:

source: Using WithArgs, our original example can be written as:
it_it: Utilizzando WithArgs, l'esempio originale può essere scritto come:

source: Using Actions
it_it: Usare le Action

source: Using Assertions in Sub-routines
it_it: Uso delle Asserzioni nelle Sub-routine

source: Using Checkpoints {#UsingCheckPoints}
it_it: Uso dei Checkpoint {#UsingCheckPoints}

source: Using Event Listeners
it_it: Utilizzo dei Listener di Eventi

source: Using Functions with Extra Info as Actions
it_it: Uso di Funzioni con Informazioni Extra come Azioni

source: Using Functions/Methods/Functors/Lambdas as Actions {#FunctionsAsActions}
it_it: Utilizzo di Funzioni/Metodi/Funtori/Lambda come Azioni {#FunctionsAsActions}

source: Using GoogleTest from various build systems
it_it: Utilizzo di GoogleTest da vari sistemi di build

source: Using Matchers
it_it: Uso dei Matcher

source: Using Matchers as Predicates
it_it: Usare i Matcher come Predicati

source: Using Matchers as Predicates {#MatchersAsPredicatesCheat}
it_it: Uso dei Matcher come Predicati {#MatchersAsPredicatesCheat}

source: Using Matchers in googletest Assertions
it_it: Uso dei Matcher nelle Asserzioni di googletest

source: Using Mocks in Tests
it_it: Uso dei Mock nei Test

source: Using Mocks in Tests {#UsingMocks}
it_it: Uso dei Mock nei Test {#UsingMocks}

source: Using Multiple Expectations {#MultiExpectations}
it_it: Uso di Expectation Multiple {#MultiExpectations}

source: Using Predicates as Matchers
it_it: Uso dei Predicati come Matcher

source: Using Simple Matchers
it_it: Uso di Semplici Matcher

source: Using `WithArgs`, our original example can be written as:
it_it: Utilizzando `WithArgs`, l'esempio originale può essere scritto come:

source: Using `pkg-config` in CMake is fairly easy:
it_it: L'uso di `pkg-config` in CMake è abbastanza semplice:

source: Using a Function That Returns an AssertionResult
it_it: Utilizzo di una Funzione che Restituisce un AssertionResult

source: Using a Function, Functor, or Lambda as an Action
it_it: Usare un Funzione, Funtore o una Lambda come Action

source: Using a Predicate-Formatter
it_it: Utilizzo di un Predicato-Formatter

source: Using a heap checker is a good idea and can alleviate the concern, but its implementation is not 100% reliable.
it_it: L'utilizzo di un "heap checker" è una buona idea e può alleviare i problemi, ma la sua implementazione non è affidabile al 100%.

source: Using a mock in this case causes pain, as it's not a strong point for mocks to perform complex actions.
it_it: Usare un mock in questo caso è faticoso, poiché non è un punto di forza per i mock eseguire azioni complesse.

source: Using a sequence, we can write the expectations
it_it: Usando una sequenza, possiamo scrivere le expectation

source: Using an Existing Boolean Function
it_it: Utilizzo di una Funzione Booleana Esistente

source: Using gMock and Threads {#UsingThreads}
it_it: Usare gMock e i Thread {#UsingThreads}

source: Using pkg-config
it_it: Uso di pkg-config

source: Using pkg-config in a cross-compilation setting
it_it: Uso di pkg-config in una impostazione di cross-compilazione

source: Using the Turtle interface as example, here are the simple steps you need to follow:
it_it: Utilizzando l'interfaccia di Turtle come esempio, ecco i semplici passaggi da seguire:

source: Using the ACTION Object's Type
it_it: Usare il Tipo dell'Oggetto ACTION

source: Using the `Turtle` interface as example, here are the simple steps you need to follow:
it_it: Utilizzando l'interfaccia di `Turtle` come esempio, ecco i semplici passaggi da seguire:

source: Using the wrong macro causes a compiler error.
it_it: L'utilizzo della macro errata provoca un errore del compilatore.

source: Usually EXPECT_* are preferred, as they allow more than one failure to be reported in a test.
it_it: Solitamente si preferiscono le EXPECT_*, poiché consentono di segnalare più di un errore in un test.

source: Usually `EXPECT_*` are preferred, as they allow more than one failure to be reported in a test.
it_it: Solitamente si preferiscono le `EXPECT_*`, poiché consentono di segnalare più di un errore in un test.

source: Usually, if your action is for a particular function type, defining it using Invoke() should be easier; if your action can be used in functions of different types (e.g. if you are defining Return(*value*)), MakePolymorphicAction() is easiest.
it_it: Di solito, se l'azione riguarda un particolare tipo di funzione, definirla utilizzando Invoke() dovrebbe essere più semplice; se l'azione può essere utilizzata in funzioni di diverso tipo (ad esempio si sta definendo Return(*value*)), MakePolymorphicAction() è più semplice.

source: Usually, if your action is for a particular function type, defining it using `Invoke()` should be easier; if your action can be used in functions of different types (e.g. if you are defining `Return(*value*)`), `MakePolymorphicAction()` is easiest.
it_it: Di solito, se l'azione riguarda un particolare tipo di funzione, definirla utilizzando `Invoke()` dovrebbe essere più semplice; se l'azione può essere utilizzata in funzioni di diverso tipo (ad esempio si sta definendo `Return(*value*)`), `MakePolymorphicAction()` è più semplice.

source: Validating a Member of an Object
it_it: Validare un Membro di un Oggetto

source: Validating the Value Pointed to by a Pointer Argument
it_it: Validare il Valore Puntato da un Argomento Puntatore

source: Value-Parameterized Tests
it_it: Test con Valori Parametrizzati

source: Value-parameterized tests can be easier to write if you need different code patterns to create different implementations' instances, e.g. new Foo vs new Bar(5).
it_it: I test con valori parametrizzati possono essere più facili da scrivere se sono necessari pattern di codice diversi per creare istanze di implementazioni diverse, ad es. new Foo contro new Bar(5).

source: Value-parameterized tests can be easier to write if you need different code patterns to create different implementations' instances, e.g. `new Foo` vs `new Bar(5)`.
it_it: I test con valori parametrizzati possono essere più facili da scrivere se sono necessari pattern di codice diversi per creare istanze di implementazioni diverse, ad es. `new Foo` contro `new Bar(5)`.

source: Value-parameterized tests only show the number of the failed iteration by default.
it_it: Per default, i test con valori parametrizzati mostrano solo il numero dell'iterazione non riuscita.

source: Verifies
it_it: Verifica

source: Verifies that *`condition`* is false.
it_it: Verifica che *`condition`* sia false.

source: Verifies that *`condition`* is true.
it_it: Verifica che *`condition`* sia true.

source: Verifies that *`expression`* is a failure `HRESULT`.
it_it: Verifica che *`expression`* sia un `HRESULT` di fallimento.

source: Verifies that *`expression`* is a success `HRESULT`.
it_it: Verifica che *`expression`* sia un `HRESULT` di successo.

source: Verifies that *`statement`* causes the process to terminate with a nonzero exit status and produces `stderr` output that matches *`matcher`*.
it_it: Verifica che *`statement`* provochi la terminazione del processo con uno stato di uscita diverso da zero e produca un output `stderr` che corrisponde al *`matcher`*.

source: Verifies that *`statement`* causes the process to terminate with an exit status that satisfies *`predicate`*, and produces `stderr` output that matches *`matcher`*.
it_it: Verifica che *`statement`* faccia terminare il processo con uno stato di uscita che soddisfi *`predicate`* e produca l'output su `stderr` che corrisponde al *`matcher`*.

source: Verifies that *`statement`* does not throw any exception.
it_it: Verifica che *`statement`* non generi alcuna eccezione.

source: Verifies that *`statement`* throws an exception of any type.
it_it: Verifica che *`statement`* generi un'eccezione di qualsiasi tipo.

source: Verifies that *`statement`* throws an exception of type *`exception_type`*.
it_it: Verifica che *`statement`* generi un'eccezione di tipo *`exception_type`*.

source: Verifies that *`val1`*`!=`*`val2`*.
it_it: Verifica che *`val1`*`!=`*`val2`*.

source: Verifies that *`val1`*`<=`*`val2`*.
it_it: Verifica che *`val1`*`<=`*`val2`*.

source: Verifies that *`val1`*`<`*`val2`*.
it_it: Verifica che *`val1`*`<`*`val2`*.

source: Verifies that *`val1`*`==`*`val2`*.
it_it: Verifica che *`val1`*`==`*`val2`*.

source: Verifies that *`val1`*`>=`*`val2`*.
it_it: Verifica che *`val1`*`>=`*`val2`*.

source: Verifies that *`val1`*`>`*`val2`*.
it_it: Verifica che *`val1`*`>`*`val2`*.

source: Verifies that *`value`* matches the [matcher](matchers.md) *`matcher`*.
it_it: Verifica che il *`value`* corrisponda al [matcher](matchers.md) *`matcher`*.

source: Verifies that condition is false.
it_it: Verifica che condition sia false.

source: Verifies that condition is true.
it_it: Verifica che condition sia true.

source: Verifies that expression is a failure HRESULT.
it_it: Verifica che expression sia un HRESULT di fallimento.

source: Verifies that expression is a success HRESULT.
it_it: Verifica che expression sia un HRESULT di successo.

source: Verifies that statement causes the process to terminate with a nonzero exit status and produces stderr output that matches matcher.
it_it: Verifica che statement provochi la terminazione del processo con uno stato di uscita diverso da zero e produca un output stderr che corrisponde al matcher.

source: Verifies that statement causes the process to terminate with an exit status that satisfies predicate, and produces stderr output that matches matcher.
it_it: Verifica che statement faccia terminare il processo con uno stato di uscita che soddisfi predicate e produca l'output su stderr che corrisponde al matcher.

source: Verifies that statement does not throw any exception.
it_it: Verifica che statement non generi alcuna eccezione.

source: Verifies that statement throws an exception of any type.
it_it: Verifica che statement generi un'eccezione di qualsiasi tipo.

source: Verifies that statement throws an exception of type exception_type.
it_it: Verifica che statement generi un'eccezione di tipo exception_type.

source: Verifies that val1!=val2.
it_it: Verifica che val1!=val2.

source: Verifies that val1<val2.
it_it: Verifica che val1<val2.

source: Verifies that val1<=val2.
it_it: Verifica che val1<=val2.

source: Verifies that val1==val2.
it_it: Verifica che val1==val2.

source: Verifies that val1>val2.
it_it: Verifica che val1>val2.

source: Verifies that val1>=val2.
it_it: Verifica che val1>=val2.

source: Verifies that value matches the matcher matcher.
it_it: Verifica che il value corrisponda al matcher corrispondente.

source: Verifies that the difference between *`val1`* and *`val2`* does not exceed the absolute error bound *`abs_error`*.
it_it: Verifica che la differenza tra *`val1`* e *`val2`* non superi il limite di errore assoluto *`abs_error`*.

source: Verifies that the difference between val1 and val2 does not exceed the absolute error bound abs_error.
it_it: Verifica che la differenza tra val1 e val2 non superi il limite di errore assoluto abs_error.

source: Verifies that the predicate *`pred_formatter`* succeeds when passed the given values as arguments.
it_it: Verifica che il predicato *`pred_formatter`* abbia esito positivo quando vengono passati i valori specificati come argomenti.

source: Verifies that the predicate *`pred`* returns `true` when passed the given values as arguments.
it_it: Verifica che il predicato *`pred`* restituisca `true` quando vengono passati i valori specificati come argomenti.

source: Verifies that the predicate pred returns true when passed the given values as arguments.
it_it: Verifica che il predicato pred restituisca truequando vengono passati i valori specificati come argomenti.

source: Verifies that the predicate pred_formatter succeeds when passed the given values as arguments.
it_it: Verifica che il predicato pred_formatter abbia esito positivo quando vengono passati i valori specificati come argomenti.

source: Verifies that the two double values val1 and val2 are approximately equal, to within 4 ULPs from each other.
it_it: Verifica che i due valori double val1 e val2 siano approssimativamente uguali, entro 4 ULP l'uno dall'altro.

source: Verifies that the two float values val1 and val2 are approximately equal, to within 4 ULPs from each other.
it_it: Verifica che i due valori float val1 e val2 siano approssimativamente uguali, entro 4 ULP l'uno dall'altro.

source: Verifies that the two C strings *`str1`* and *`str2`* have different contents, ignoring case.
it_it: Verifica che due stringhe C *`str1`* e *`str2`* abbiano contenuto diverso, ignorando maiuscole e minuscole.

source: Verifies that the two C strings *`str1`* and *`str2`* have different contents.
it_it: Verifica che due stringhe C *`str1`* e *`str2`* abbiano contenuto diverso.

source: Verifies that the two C strings *`str1`* and *`str2`* have the same contents, ignoring case.
it_it: Verifica che due stringhe C *`str1`* e *`str2`* abbiano lo stesso contenuto, ignorando maiuscole e minuscole.

source: Verifies that the two C strings *`str1`* and *`str2`* have the same contents.
it_it: Verifica che due stringhe C *`str1`* and *`str2`* abbiano lo stesso contenuto.

source: Verifies that the two C strings str1 and str2 have different contents, ignoring case.
it_it: Verifica che due stringhe C str1 e str2 abbiano contenuto diverso, ignorando maiuscole e minuscole.

source: Verifies that the two C strings str1 and str2 have different contents.
it_it: Verifica che due stringhe C str1 e str2 abbiano contenuto diverso.

source: Verifies that the two C strings str1 and str2 have the same contents, ignoring case.
it_it: Verifica che due stringhe C str1 e str2 abbiano lo stesso contenuto, ignorando maiuscole e minuscole.

source: Verifies that the two C strings str1 and str2 have the same contents.
it_it: Verifica che due stringhe C str1 e str2 abbiano lo stesso contenuto.

source: Verifies that the two `double` values *`val1`* and *`val2`* are approximately equal, to within 4 ULPs from each other.
it_it: Verifica che i due valori `double` *`val1`* e *`val2`* siano approssimativamente uguali, entro 4 ULP l'uno dall'altro.

source: Verifies that the two `float` values *`val1`* and *`val2`* are approximately equal, to within 4 ULPs from each other.
it_it: Verifica che i due valori `float` *`val1`* e *`val2`* siano approssimativamente uguali, entro 4 ULP l'uno dall'altro.

source: Verifying Complex Arguments {#SaveArgVerify}
it_it: Verifica di argomenti Complessi {#SaveArgVerify}

source: Verifying and Resetting a Mock
it_it: Verificare e Resettare un Mock

source: Very bad.
it_it: Molto brutto.

source: Wait for all shards to finish, then collect and report the results.
it_it: Attendi che tutti gli shard finiscano, quindi raccogliere e riportare i risultati.

source: Want some tips?
it_it: Si cercano Suggerimenti?

source: Want to do more than one thing when a function is called?
it_it: Si vuol fare più di una cosa quando viene chiamata una funzione?

source: We agree with you completely, and that's why Google Test provides a basic implementation of main().
it_it: Siamo completamente d'accordo ed è per questo che Google Test fornisce un'implementazione di base di main().

source: We call its argument a cardinality as it tells how many times the call should occur.
it_it: Chiamiamo il suo argomento una cardinalità per dire quante volte dovrebbe verificarsi la chiamata.

source: We already know that you can specify constraints on the order of mock function calls, so all we need to do is to mock the destructor of the mock function.
it_it: Sappiamo già che è possibile specificare vincoli sull'ordine delle chiamate alla funzione mock, quindi tutto ciò che dobbiamo fare è avere il mock del distruttore della funzione mock.

source: We already know that you can specify constraints on the [order](#OrderedCalls) of mock function calls, so all we need to do is to mock the destructor of the mock function.
it_it: Sappiamo già che è possibile specificare vincoli sull'[ordine](#OrderedCalls) delle chiamate alla funzione mock, quindi tutto ciò che dobbiamo fare è avere il mock del distruttore della funzione mock.

source: We as users have to tell it what to do when a method is invoked.
it_it: Noi come utenti dobbiamo dirgli cosa fare quando viene invocato un metodo.

source: We believe the benefit doesn't justify the cost.
it_it: Riteniamo che il vantaggio non giustifichi il costo.

source: We believe:
it_it: Noi crediamo che:

source: We call this technique sharding, where each machine is called a shard.
it_it: Chiamiamo questa tecnica sharding, dove ogni macchina è chiamata shard.

source: We call its argument a **cardinality** as it tells *how many times* the call should occur.
it_it: Chiamiamo il suo argomento una **cardinalità** per dire *quante volte* dovrebbe verificarsi la chiamata.
